Тест_ЗУП_31_КОРП/src/Enums/ВидыРабочегоВремениСотрудников/ВидыРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРабочегоВремениСотрудников</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ВидыРабочегоВремениСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКИИ

// Составляет массив видов рабочего времени, обозначающих время, затраченное за целый день.
// 
Функция ЦелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЦелодневноеНеотработанное);
	
	Возврат ВидыВремени;
	
КонецФункции

// Составляет массив видов рабочего времени, обозначающих время, затраченное за неполную рабочую смену
// (внутрисменные отклонения или работу неполный рабочий день).
// 
Функция НецелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеНеотработанное);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

// Составляет массив видов рабочего времени, обозначающих отработанное время.
// 
Функция ВидыОтработанногоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеСверхНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

#КонецЕсли
